import React from "react";
import { ScrollView, Text, Dimensions } from "react-native";

const { width } = Dimensions.get("window");
const Conditions = () => {
  return (
    <ScrollView contentContainerStyle={{ alignItems: "center", justifyContent: "center" }}>
      <Text style={{ width: width - 50, lineHeight: 20 }}>
        {"\n"}
        {"\n"}
        <Text style={{ fontSize: 34, color: "orangered" }}>저기어때</Text>
        {"\n"}
        {"\n"}
        <Text style={{ fontSize: 20 }}>이용약관</Text> {"\n"}
        {"\n"} {"\n"}
        제1조(목적){"\n"}이 약관은 ㈜저기어때(이하 "회사"라 합니다)가 제공하는 서비스(이하 "서비스"라 합니다) 이용과
        관련하여 회사와 이용자 간의 권리∙의무 및 필요한 제반사항을 정함을 목적으로 합니다. {"\n"}
        {"\n"}제2조(용어의 정의){"\n"}① 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.{"\n"}
        1. "이용고객"란 회사가 제공하는 서비스를 이용하기 위해 앱스토어사업자 또는 플랫폼사업자가 운영하는
        앱스토어마켓에서 애플리케이션을 다운로드 받은 자를 말합니다.{"\n"}2. "이용자"란 이 약관 및 개인정보처리방침에
        동의하고 회사가 제공하는 서비스 이용자격을 부여 받은 이용고객을 말합니다.{"\n"}3. "서비스"란 회사가 제공하는
        서비스 일체를 의미합니다.{"\n"}4. "단말기"란 서비스를 이용할 수 있는 휴대폰, 스마트폰, 태블릿 등 유무선 기기를
        말합니다.{"\n"}5. "애플리케이션"이란 회사가 제공하는 서비스를 이용할 수 있는 프로그램 일체를 의미합니다.{"\n"}6.
        "앱스토어(오픈마켓)사업자"란 회사가 제공하는 애플리케이션을 다운로드 받을 수 있고, In-App결제를 할 수 있도록
        하는 오픈마켓 사업자를 말합니다.{"\n"}7. "플랫폼사업자"란 회사와 제휴하여 서비스를 제공하는 사업자 및 관련
        서비스 일체를 말합니다.{"\n"}8. "이용자 계정"이란 이용자의 식별과 서비스 이용을 위하여 이용자가 선정하고
        플랫폼사업자가 부여하는 문자, 숫자 또는 특수문자의 조합을 의미합니다.{"\n"}9. "콘텐츠"란 회사가 서비스에서
        이용할 수 있도록 제작한 아이템 등을 말합니다.{"\n"}10. "유료콘텐츠"란 이용자가 서비스를 이용함에 있어 특정한
        효과 또는 효능을 향유하기 위하여 In-App결제를 통해 구매하는 콘텐츠를 의미합니다.{"\n"}11. "무료콘텐츠"란
        이용자가 서비스에서 직접 유료로 구매하지 않고, 다른 이용자로부터 선물받거나 서비스를 이용하면서 무료로 취득한
        콘텐츠를 의미합니다.{"\n"}12. "In-App결제(In-App Purchase)"란 애플리케이션 내에서 유료콘텐츠를 구매하기 위한
        결제 행위를 말합니다. ② 이 약관에서 사용하는 용어의 정의는 제1항에서 정하는 것을 제외하고는 관계법령에서 정하는
        바에 따릅니다. 관계법령에서 정하지 않는 것은 일반적인 상관례에 의합니다.{"\n"}
        {"\n"}
        제3조(회사정보 등의 제공) 회사는 다음 각호의 사항을 서비스 초기화면이나 회사의 웹사이트에 게시하여 이용자가 이를
        쉽게 알 수 있도록 합니다. 다만, 이 약관 및 개인정보처리방침은 이용자가 연결화면을 통하여 볼 수 있도록 할 수
        있습니다.{"\n"}1. 상호 및 대표자의 성명{"\n"}2. 영업소 소재지 주소(이용자의 불만을 처리할 수 있는 곳의 주소를
        포함한다) 및 전자우편주소{"\n"}3. 전화번호, FAX 번호{"\n"}4. 사업자등록번호, 통신판매업 신고번호{"\n"}5.
        개인정보처리방침{"\n"}6. 서비스이용약관{"\n"}
        {"\n"}제4조(약관의 효력 및 변경){"\n"}① 회사는 이 약관을 이용자가 알 수 있도록 회사의 웹사이트 게시하거나 서비스
        이용을 위한 애플리케이션 내의 연결화면 등을 통해 이용자에게 공지 함으로써 효력이 발생합니다.{"\n"}② 회사는 관련
        법령의 변경이나 이용자의 권리 및 의무사항을 개선하기 위해 「전자상거래 등에서의 소비자보호에 관한 법률」,
        「약관의 규제에 관한 법률」, 「정보통신망이용촉진 및 정보보호 등에 관한 법률」, 「콘텐츠산업진흥법」 등 관련
        법령에 위배하지 않는 범위에서 이 약관을 변경할 수 있으며, 변경된 약관은 적용일자 및 변경내용, 변경사유 등을
        명시하여 그 적용일 7일 이전부터 그 적용일자 경과 후 일정기간이 경과할 때까지 회사 웹사이트나 서비스별 공식
        블로그 또는 애플리케이션의 Push 알림 등을 통해 이용자에게 공지합니다. 다만, 이용자의 권리∙의무에 중대한 영향을
        미치는 사항에 대하여는 그 적용일 30일 이전부터 공지합니다.{"\n"}③ 이용자는 변경되는 약관에 대해 동의하지 않을 수
        있으며, 변경되는 약관에 동의하지 않는 경우에는 서비스 이용을 중단하고 서비스에서 탈퇴를 할 수 있습니다. 다만,
        제2항의 방법으로 변경되는 약관의 공지 시 이용자가 별도의 의사표시를 하지 않으면 승낙한 것으로 본다고
        공지하였음에도 불구하고, 변경되는 약관의 적용일 전일까지 회사에 대해 명시적으로 의사표시를 하지 아니하는 경우
        또는 이용자가 변경되는 이용약관의 적용일 이후에도 서비스를 계속 이용하는 경우에는 변경된 약관에 동의한 것으로
        봅니다.{"\n"}
        {"\n"}
        제5조(약관 외 준칙){"\n"}이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「전자상거래 등에서의
        소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「정보통신망이용촉진 및 정보보호 등에 관한 법률」,
        「콘텐츠산업진흥법」 등 관련 법령 및 상관례에 따릅니다.{"\n"}
        {"\n"}
        제6조(이용 계약의 성립){"\n"}① 서비스 이용계약은 "이용고객"이 애플리케이션을 설치 및 구동하여 이 약관 및
        개인정보처리방침에 대한 동의하면 그 이용신청에 대한 회사의 이용승낙으로 성립합니다. 이용고객의 서비스 이용신청
        완료 후 단말기내에서 애플리케이션이 정상적으로 구동되는 경우에는 서비스 이용이 승낙된 것으로 간주됩니다.{"\n"}②
        이용자는 서비스 이용신청 또는 이용시 본인의 실제정보(이하 "실명정보"라 합니다)를 기재하여야 합니다. 실명정보를
        허위로 기재하거나 타인의 명의를 도용하는 경우 이 약관에 의한 이용자의 권리를 주장할 수 없고, 회사는 이용계약을
        취소하거나 해지할 수 있습니다. 이용자가 플랫폼사업자에게 실명정보를 제공하고 플랫폼사업자를 통해 서비스를
        이용하는 경우에도 동일하게 간주됩니다.{"\n"}④ 회사는 다음 각 호의 어느 하나에 해당하는 이용신청에 대해서는
        승낙을 하지 않을 수 있습니다.{"\n"}1. 콘텐츠 구매 대금을 납부하지 않거나 잘못 납부하여 확인할 수 없는 경우{"\n"}
        2. 18세 미만의 청소년{"\n"}3. 서비스별로 1인당 1개 초과의 계정을 생성하는 경우{"\n"}4. 개인 정보를 허위로
        제공하는 경우{"\n"}5. 최근 3개월 내 이용제한 기록이 있거나, 서비스 운영정책에 따라 서비스 이용제한(영구제한)을
        받은 이용자가 이용신청을 하는 경우{"\n"}6. 제3자의 신용카드, 유/무선 전화, 은행 계좌 등을 무단으로 이용 또는
        도용하여 콘텐츠를 구매하거나 이용한 경우{"\n"}7. 대한민국 이외의 국가 중 회사에서 아직 서비스를 제공할 것으로
        결정하지 않은 국가에서 서비스를 이용하는 경우로 회사가 해외 서비스 업체와 체결한 계약이나 특정 국가에서 접속하는
        회원에 대한 서비스 제공과 관련하여 서비스 제공을 제한할 필요가 있는 경우{"\n"}8. 「정보통신망 이용촉진 및
        정보보호 등에 관한 법률」 및 그 밖의 관계 법령에서 금지하는 위법행위를 할 목적으로 이용신청을 하는 경우{"\n"}9.
        그 밖에 제1호 내지 제8호에 준하는 사유로서 승낙이 부적절하다고 판단되는 경우{"\n"}
        {"\n"}제7조(이용자 계정 관리){"\n"}① 회사는 이용자 계정을 통하여 이용자의 서비스 이용가능 여부 등 제반 이용자
        관리업무를 수행합니다.{"\n"}② 이용자는 자신의 이용자 계정을 선량한 관리자로서의 주의 의무를 다하여 관리하여야
        합니다. 회사는 이용자가 자신의 이용자 계정을 소홀히 관리하거나 제3자에게 이용을 승낙함으로써 발생하는 손해에
        대해 어떠한 책임도 부담하지 않습니다.{"\n"}
        {"\n"}제8조(개인정보의 보호 및 관리){"\n"}① 회사는 관련 법령이 정하는 바에 따라 이용자 계정을 포함한 이용자의
        개인정보를 보호하기 위해 노력합니다. 이용자의 개인정보 보호 및 사용에 대해서는 관련 법령 및 회사가 별도로 정하여
        고지한 개인정보처리방침에 따릅니다.{"\n"}② 회사의 웹사이트 또는 서비스에서 단순히 링크된 제3자 제공의 서비스에
        대하여는 회사의 개인정보처리방침이 적용되지 않습니다.{"\n"}③ 회사는 이용자의 귀책사유로 인하여 노출된 이용자
        계정을 포함한 이용자의 개인정보에 대해서 일체의 책임을 지지 않습니다.
        {"\n"}
        {"\n"}제9조(회사의 의무){"\n"}① 회사는 관련 법령을 준수하고, 이 약관이 정하는 권리의 행사와 의무의 이행을 신의에
        따라 성실하게 합니다.{"\n"}② 회사는 이용자로부터 제기되는 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는
        합리적인 기간내에 신속하게 처리하여야 합니다. 다만, 처리에 장기간이 소요되는 경우에는 이용자에게 그 사유와
        처리일정을 별도로 고지 합니다.{"\n"}③ 회사는 이용자가 안전하게 서비스를 이용할 수 있도록 이용자 계정을 포함한
        이용자의 개인정보를 안전하게 관리하며, 이 약관 및 개인정보처리방침에서 정한 경우를 제외하고는 이용자의
        개인정보를 제3자에게 제공하거나 공개하지 않습니다.{"\n"}④ 회사는 계속적이고 안정적인 서비스의 제공을 위하여
        서비스 개선을 하던 중 설비에 장애가 생기거나 데이터 등이 멸실된 때에는 천재지변, 비상사태, 현재의 기술로는
        해결이 곤란한 기술적 결함 및 장애 등 부득이한 사유가 없는 한 지체없이 이를 수리 또는 복구하도록 최선의 노력을
        다합니다.{"\n"}⑤ 회사는 이용계약의 체결, 계약사항의 변경 및 해지 등 이용자와의 계약관련 절차 및 내용 등에 있어
        이용자에게 편의를 제공하도록 노력합니다.
      </Text>
    </ScrollView>
  );
};

export default Conditions;
